event20100327/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "passward", "nane") VALUES('2010-07-17 05:10:45', '2010-07-17 05:10:45', 'hogow', 'babo')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-07-17 05:39:38', "passward" = 'fooo' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])